%	Esquema de arvore genealogica em prolog
%-------------------pai--------------------------
pai(luiz, rosa).
pai(henrique, abel).
pai(jose, rose).
pai(joao, juscelino).
pai(abel, elizabeth).
pai(abel, lucia).
pai(juscelino, eliseu).
pai(juscelino, antonio).
pai(silverio, julia).
pai(eliseu, bruno).
pai(antonio, felipe).

%-------------------mae--------------------------
mae(adriana,rosa).
mae(cristina,abel).
mae(luiza, rose).
mae(maria, juscelino).
mae(rosa, elizabeth).
mae(rosa, lucia).
mae(rose, eliseu).
mae(rose, antonio).
mae(elizabeth, julia).
mae(lucia, bruno).
mae(vilma, felipe).

%-------------------consultas--------------------
%-----------------------------filho----------------------------%
filho(A, C) :- pai(C, A).						     		   %
filho(A, C) :- mae(C, A).									   %
%--------------------------------------------------------------%

%-----------------------------irmão----------------------------%
irmao(A, C) :- pai(B, C), pai(B, A).						   %
%--------------------------------------------------------------%

%-----------------------------Avô------------------------------%
avo(A, C) :- pai(B, C), pai(A, B).							   %
avo(A, C) :- pai(A, B), mae(B, C), !.						   %
%--------------------------------------------------------------%

%-----------------------------Avó------------------------------%
avoh(A, C) :- mae(A, B), pai(B, C).							   %
avoh(A, C) :- mae(A, B), mae(B, C), !.						   %
%--------------------------------------------------------------%

%---------------------------bisavô-----------------------------%
bisavo(A, C) :- avo(B, C), pai(A, B).						   %
bisavo(A, C) :- avoh(B, C), pai(A, B), !.					   %
%--------------------------------------------------------------%

%---------------------------bisavó-----------------------------%
bisavoh(A, C) :- avo(B, C), mae(A, B).						   %
bisavoh(A, C) :- avoh(B, C), mae(A, B), !.					   %
%--------------------------------------------------------------%

%-----------------------------tio------------------------------%
tio(A, C) :- pai(B, C), irmao(A, B).						   %
tio(A, C) :- mae(B, C), irmao(A, B).						   %
%--------------------------------------------------------------%

%-----------------------------primo----------------------------%
primo(A, C) :- tio(B, C), filho(A, B).						   %
%--------------------------------------------------------------%

%----------------------------neto------------------------------%
neto(A, C) :- filho(B, C), filho(A, B).						   %
%--------------------------------------------------------------%